Router>enable

Router#configure terminal 

Router(config)#hostname R-01

R-01(config)#interface gigabitEthernet 0/0/0

R-01(config-if)#Description SW-01
R-01(config-if)#ip address 172.16.1.254 255.255.255.0
R-01(config-if)#ip helper-
R-01(config-if)#ip helper-address 172.16.0.2
R-01(config-if)#no shutdown
R-01(config-if)#exit

R-01(config)#
R-01(config)#interface gigabitEthernet 0/0/1
R-01(config-if)#Description SW-02
R-01(config-if)#ip address 172.16.2.254 255.255.255.0
R-01(config-if)#ip helper-address 172.16.0.2
R-01(config-if)#no shutdown


R-01(config-if)#exit
R-01(config)#
R-01(config)#interface serial 0/1/0
R-01(config-if)#Description R-02 Link
R-01(config-if)#ip address 172.16.5.177 255.255.255.252
R-01(config-if)#no shutdown

%LINK-5-CHANGED: Interface Serial0/1/0, changed state to down
R-01(config-if)#exit
R-01(config)#
R-01(config)#interface serial 0/1/1
R-01(config-if)#Description R-08 Link
R-01(config-if)#ip address 172.16.5.201 255.255.255.252
R-01(config-if)#no shutdown

%LINK-5-CHANGED: Interface Serial0/1/1, changed state to down
R-01(config-if)#exit

R-01(config)#ip route 172.16.0.0 255.255.255.0 172.16.5.178
R-01(config)#ip route 172.16.3.0 255.255.255.128 172.16.5.178
R-01(config)#ip route 172.16.3.128 255.255.255.128 172.16.5.178
R-01(config)#ip route 172.16.4.0 255.255.255.192 172.16.5.178
R-01(config)#ip route 172.16.4.64 255.255.255.192 172.16.5.178
R-01(config)#ip route 172.16.4.128 255.255.255.192 172.16.5.178
R-01(config)#ip route 172.16.4.192 255.255.255.192 172.16.5.202
R-01(config)#ip route 172.16.5.0 255.255.255.192 172.16.5.178
R-01(config)#ip route 172.16.5.64 255.255.255.224 172.16.5.178
R-01(config)#ip route 172.16.5.96 255.255.255.224 172.16.5.178
R-01(config)#ip route 172.16.5.128 255.255.255.224 172.16.5.178
R-01(config)#ip route 172.16.5.160 255.255.255.240 172.16.5.202
R-01(config)#ip route 172.16.5.180 255.255.255.252 172.16.5.178
R-01(config)#ip route 172.16.5.184 255.255.255.252 172.16.5.178
R-01(config)#ip route 172.16.5.188 255.255.255.252 172.16.5.178
R-01(config)#ip route 172.16.5.192 255.255.255.252 172.16.5.178
R-01(config)#ip route 172.16.5.196 255.255.255.252 172.16.5.178
R-01(config)#
R-01(config)#
R-01(config)#exit
R-01#
%SYS-5-CONFIG_I: Configured from console by console


R-01#copy running-config Startup-config 


R-01#copy running-config tftp: 
Address or name of remote host []? 172.16.0.2
Destination filename [R-01-confg]? 
R-01#copy running-config tftp: 
Address or name of remote host []? 172.16.0.2
Destination filename [R-01-confg]? R-01-confg

Writing running-config...!!
[OK - 1820 bytes]

1820 bytes copied in 0.026 secs (70000 bytes/sec)

R-01#clock set 14:30:00 07 september 2025

R-01#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.

R-01(config)#banner motd *
Enter TEXT message.  End with the character '*'.

###################################################
This is Secure area. Please Enter your Authentication.
#################################################### *

R-01(config)#
R-01(config)#enable secret DilRu@2520.lk
R-01(config)#
R-01(config)#line console 0
R-01(config-line)#
R-01(config-line)#password DIlru@2540.lk
R-01(config-line)#exec-timeout 20
R-01(config-line)#login
R-01(config-line)#exit
R-01(config)#
R-01(config)#security passwords min-length 10
R-01(config)#ip domain-name sltsc.lk
R-01(config)#crypto key generate rsa
The name for the keys will be: R-01.sltsc.lk
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: 2048
% Generating 2048 bit RSA keys, keys will be non-exportable...[OK]

R-01(config)#username sshadmin secret Admin@$ltSc.Lk
*Sep 7 14:30:15.590: %SSH-5-ENABLED: SSH 1.99 has been enabled

R-01(config)#line vty 0
R-01(config-line)#transport input ssh
R-01(config-line)#login local 
R-01(config-line)#exec-timeout 20
R-01(config-line)#login local 
R-01(config-line)#exit
R-01(config)#
R-01(config)#login block-for 900 attempts 2 within 60



