Router>enable

Router#configure terminal 

Router(config)#interface serial 0/1/0
Router(config-if)#des
Router(config-if)#description R-01 Link

Router(config-if)#clock rate 64000
Router(config-if)#ip address 172.16.5.178 255.255.255.252
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface Serial0/1/0, changed state to up

Router(config-if)#exit
Router(config)#
Router(config)#description R-01 Link
%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/1/0,
Router(config)#interface serial 0/1/1
Router(config-if)#description R-03 Link
Router(config-if)#ip address 172.16.5.182 255.255.255.252
Router(config-if)#clock rate 64000
Router(config-if)#no shutdown

%LINK-5-CHANGED: Interface Serial0/1/1, changed state to down
Router(config-if)#exit
Router(config)#hostname R-02
R-02(config)#
R-02(config)#
R-02(config)#interface serial 0/2/0
R-02(config-if)#description R-04 Link
R-02(config-if)#ip address 172.16.5.186 255.255.255.252
R-02(config-if)#clock rate 64000
R-02(config-if)#no shutdown

%LINK-5-CHANGED: Interface Serial0/2/0, changed state to down
R-02(config-if)#exit
R-02(config)#
R-02(config)#
R-02(config)#interface serial 0/2/1
R-02(config-if)#description R-05 Link
R-02(config-if)#ip address 172.16.5.190 255.255.255.252
R-02(config-if)#clock rate 64000
R-02(config-if)#no shutdown

%LINK-5-CHANGED: Interface Serial0/2/1, changed state to down
R-02(config-if)#
R-02(config-if)#exit

R-02(config)#ip route 172.16.0.0 255.255.255.0 172.16.5.189
R-02(config)#ip route 172.16.1.0 255.255.255.0 172.16.5.177
R-02(config)#ip route 172.16.2.0 255.255.255.0 172.16.5.177
R-02(config)#ip route 172.16.3.0 255.255.255.128 172.16.5.189
R-02(config)#ip route 172.16.3.128 255.255.255.128 172.16.5.181
R-02(config)#ip route 172.16.4.0 255.255.255.192 172.16.5.185
R-02(config)#ip route 172.16.4.64 255.255.255.192 172.16.5.181
R-02(config)#ip route 172.16.4.128 255.255.255.192 172.16.5.185
R-02(config)#ip route 172.16.4.192 255.255.255.192 172.16.5.177
R-02(config)#ip route 172.16.5.0 255.255.255.192 172.16.5.181
R-02(config)#ip route 172.16.5.64 255.255.255.224 172.16.5.189
R-02(config)#ip route 172.16.5.96 255.255.255.224 172.16.5.181
R-02(config)#ip route 172.16.5.128 255.255.255.224 172.16.5.189
R-02(config)#ip route 172.16.5.160 255.255.255.240 172.16.5.177
R-02(config)#ip route 172.16.5.192 255.255.255.252 172.16.5.189
R-02(config)#ip route 172.16.5.196 255.255.255.252 172.16.5.181
R-02(config)#ip route 172.16.5.200 255.255.255.252 172.16.5.177
R-02(config)#
R-02(config)#
R-02(config)#
R-02(config)#exit
R-02#
%SYS-5-CONFIG_I: Configured from console by console


R-02#copy Running-config startup-config 
Destination filename [startup-config]? 
Building configuration...


R-02#copy running-config tftp: 
Address or name of remote host []? 172.16.0.2
Destination filename [R-02-confg]? R-02-confg

Writing running-config...!!
[OK - 1934 bytes]

1934 bytes copied in 0.033 secs (58606 bytes/sec)

R-02#clock set 14:30:00 07 september 2025
R-02#
R-02#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R-02(config)#
R-02(config)#banner motd *
Enter TEXT message.  End with the character '*'.

###################################################
This is Secure area. Please Enter your Authentication.
#################################################### *

R-02(config)#
R-02(config)#enable secret DilRu@2520.lk
R-02(config)#
R-02(config)#line console 0
R-02(config-line)#
R-02(config-line)#password DIlru@2540.lk
R-02(config-line)#exec-timeout 20
R-02(config-line)#login
R-02(config-line)#exit
R-02(config)#
R-02(config)#security passwords min-length 10
R-02(config)#ip domain-name sltsc.lk
R-02(config)#crypto key generate rsa
The name for the keys will be: R-02.sltsc.lk
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: 2048
% Generating 2048 bit RSA keys, keys will be non-exportable...[OK]

R-02(config)#
*Sep 7 14:30:6.75: %SSH-5-ENABLED: SSH 1.99 has been enabled
R-02(config)#username sshadmin secret Admin@$ltSc.Lk
R-02(config)#
R-02(config)#line vty 0
R-02(config-line)#transport input ssh
R-02(config-line)#login local 
R-02(config-line)#exec-timeout 20
R-02(config-line)#login local 
R-02(config-line)#exit
R-02(config)#
R-02(config)#login block-for 900 attempts 2 within 60