Router>enable

Router#configure terminal 
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname R-05

R-05(config)#interface gigabitEthernet 0/0/0
R-05(config-if)#Des
R-05(config-if)#Description SW-07 Link
R-05(config-if)#ip address 172.16.3.126 255.255.255.128
R-05(config-if)#ip help
R-05(config-if)#ip helper-address 172.16.0.2
R-05(config-if)#no shutdown

R-05(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0/0, changed state to up

R-05(config-if)#interface gigabitEthernet 0/0/1
R-05(config-if)#Description SW-08 Link
R-05(config-if)#ip address 172.16.5.94 255.255.255.224
R-05(config-if)#ip helper-address 172.16.0.2
R-05(config-if)#no shutdown

R-05(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0/1, changed state to up

R-05(config-if)#exit
R-05(config)#interface serial 0/2/0
R-05(config-if)#des
R-05(config-if)#description R-06 Link
R-05(config-if)#ip address 172.16.5.194 255.255.255.252
R-05(config-if)#clock rate 64000
R-05(config-if)#no shutdown

%LINK-5-CHANGED: Interface Serial0/2/0, changed state to down
R-05(config-if)#
R-05(config-if)#exit
R-05(config)#
R-05(config)#interface serial 0/2/1
R-05(config-if)#description R-02 Link
R-05(config-if)#ip address 172.16.5.189 255.255.255.252
R-05(config-if)#no shutdown

R-05(config-if)#
%LINK-5-CHANGED: Interface Serial0/2/1, changed state to up

R-05(config-if)#exit
R-05(config)#

R-05(config)#ip route 172.16.0.0 255.255.255.0 172.16.5.193
R-05(config)#ip route 172.16.1.0 255.255.255.0 172.16.5.190
R-05(config)#ip route 172.16.2.0 255.255.255.0 172.16.5.190
R-05(config)#ip route 172.16.3.128 255.255.255.128 172.16.5.190
R-05(config)#ip route 172.16.4.0 255.255.255.192 172.16.5.190
R-05(config)#ip route 172.16.4.64 255.255.255.192 172.16.5.190
R-05(config)#ip route 172.16.4.128 255.255.255.192 172.16.5.190
R-05(config)#ip route 172.16.4.192 255.255.255.192 172.16.5.190
R-05(config)#ip route 172.16.5.0 255.255.255.192 172.16.5.190
R-05(config)#ip route 172.16.5.96 255.255.255.224 172.16.5.190
R-05(config)#ip route 172.16.5.128 255.255.255.224 172.16.5.193
R-05(config)#ip route 172.16.5.160 255.255.255.240 172.16.5.190
R-05(config)#ip route 172.16.5.176 255.255.255.252 172.16.5.190
R-05(config)#ip route 172.16.5.180 255.255.255.252 172.16.5.190
R-05(config)#ip route 172.16.5.184 255.255.255.252 172.16.5.190
R-05(config)#ip route 172.16.5.196 255.255.255.252 172.16.5.190
R-05(config)#ip route 172.16.5.200 255.255.255.252 172.16.5.190
R-05(config)#
R-05(config)#exit
R-05#
%SYS-5-CONFIG_I: Configured from console by console


R-05#copy running-config startup-config 
Destination filename [startup-config]?

Destination filename [R-05-confg]? R-05-confg

Writing running-config...!!
[OK - 1846 bytes]

1846 bytes copied in 0.006 secs (307666 bytes/sec

R-05>enable
R-05#clock set 14:30:00 07 september 2025
R-05#
R-05#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R-05(config)#
R-05(config)#banner motd *
Enter TEXT message.  End with the character '*'.

###################################################
This is Secure area. Please Enter your Authentication.
#################################################### *

R-05(config)#
R-05(config)#enable secret DilRu@2520.lk
R-05(config)#
R-05(config)#line console 0
R-05(config-line)#
R-05(config-line)#password DIlru@2540.lk
R-05(config-line)#exec-timeout 20
R-05(config-line)#login
R-05(config-line)#exit
R-05(config)#
R-05(config)#security passwords min-length 10
R-05(config)#ip domain-name sltsc.lk
R-05(config)#crypto key generate rsa
The name for the keys will be: R-05.sltsc.lk
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: 2048
% Generating 2048 bit RSA keys, keys will be non-exportable...[OK]

R-05(config)#username sshadmin secret Admin@$ltSc.Lk
*Sep 7 14:30:5.442: %SSH-5-ENABLED: SSH 1.99 has been enabled
R-05(config)#
R-05(config)#line vty 0
R-05(config-line)#transport input ssh
R-05(config-line)#login local 
R-05(config-line)#exec-timeout 20
R-05(config-line)#login local 
R-05(config-line)#exit
R-05(config)#
R-05(config)#login block-for 900 attempts 2 within 60
R-05(config)#
R-05(config)#