Router>enable

Router#configure terminal 
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#
Router(config)#hostname R-06

R-06(config)#interface gigabitEthernet 0/0/0
R-06(config-if)#de
R-06(config-if)#des
R-06(config-if)#description SW-09 Link
R-06(config-if)#ip address 172.16.5.158 255.255.255.224
R-06(config-if)#ip help
R-06(config-if)#ip helper-address 172.16.0.2
R-06(config-if)#
R-06(config-if)#no shutdown

R-06(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0/0, changed state to up

R-06(config-if)#exit
R-06(config)#
R-06(config)#interface gigabitEthernet 0/0/1
R-06(config-if)#description SW-10 Link
R-06(config-if)#ip address 172.16.0.254 255.255.255.0
R-06(config-if)#ip helper-address 172.16.0.2
R-06(config-if)#no shutdown

R-06(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0/1, changed state to up

R-06(config-if)#exit
R-06(config)#
R-06(config)#interface serial 0/2/0
R-06(config-if)#des
R-06(config-if)#description R-05 Link
R-06(config-if)#ip address 172.16.5.193 255.255.255.252
R-06(config-if)#no shutdown

R-06(config-if)#
%LINK-5-CHANGED: Interface Serial0/2/0, changed state to up

R-06(config-if)#exit
R-06(config

R-06(config)#ip route 172.16.1.0 255.255.255.0 172.16.5.194
R-06(config)#ip route 172.16.2.0 255.255.255.0 172.16.5.194
R-06(config)#ip route 172.16.3.0 255.255.255.128 172.16.5.194
R-06(config)#ip route 172.16.3.128 255.255.255.128 172.16.5.194
R-06(config)#ip route 172.16.4.0 255.255.255.192 172.16.5.194
R-06(config)#ip route 172.16.4.64 255.255.255.192 172.16.5.194
R-06(config)#ip route 172.16.4.128 255.255.255.192 172.16.5.194
R-06(config)#ip route 172.16.4.192 255.255.255.192 172.16.5.194
R-06(config)#ip route 172.16.5.0 255.255.255.192 172.16.5.194
R-06(config)#ip route 172.16.5.64 255.255.255.224 172.16.5.194
R-06(config)#ip route 172.16.5.96 255.255.255.224 172.16.5.194
R-06(config)#ip route 172.16.5.160 255.255.255.240 172.16.5.194
R-06(config)#ip route 172.16.5.176 255.255.255.252 172.16.5.194
R-06(config)#ip route 172.16.5.180 255.255.255.252 172.16.5.194
R-06(config)#ip route 172.16.5.184 255.255.255.252 172.16.5.194
R-06(config)#ip route 172.16.5.188 255.255.255.252 172.16.5.194
R-06(config)#ip route 172.16.5.196 255.255.255.252 172.16.5.194
R-06(config)#ip route 172.16.5.200 255.255.255.252 172.16.5.194
R-06(config)#
R-06(config)#exit
R-06#
%SYS-5-CONFIG_I: Configured from console by console

R-06#copy r
R-06#copy running-config st
R-06#copy running-config startup-config 
Destination filename [startup-config]? 

R-06#copy running-config tftp: 
Address or name of remote host []? 172.16.0.2
Destination filename [R-06-confg]? R-06-confg

Writing running-config...!!
[OK - 1861 bytes]

1861 bytes copied in 0.014 secs (132928 bytes/sec)
R-06#

R-06#clock set 14:30:00 07 september 2025
R-06#
R-06#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R-06(config)#
R-06(config)#banner motd *
Enter TEXT message.  End with the character '*'.

###################################################
This is Secure area. Please Enter your Authentication.
#################################################### *

R-06(config)#
R-06(config)#enable secret DilRu@2520.lk
R-06(config)#
R-06(config)#line console 0
R-06(config-line)#
R-06(config-line)#password DIlru@2540.lk
R-06(config-line)#exec-timeout 20
R-06(config-line)#login
R-06(config-line)#exit
R-06(config)#
R-06(config)#security passwords min-length 10
R-06(config)#ip domain-name sltsc.lk
R-06(config)#crypto key generate rsa
The name for the keys will be: R-06.sltsc.lk
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: 2048
% Generating 2048 bit RSA keys, keys will be non-exportable...[OK]

R-06(config)#username sshadmin secret Admin@$ltSc.Lk
*Sep 7 14:30:9.599: %SSH-5-ENABLED: SSH 1.99 has been enabled
R-06(config)#
R-06(config)#line vty 0
R-06(config-line)#transport input ssh
R-06(config-line)#login local 
R-06(config-line)#exec-timeout 20
R-06(config-line)#login local 
R-06(config-line)#exit
R-06(config)#
R-06(config)#login block-for 900 attempts 2 within 6