Router>enable

Router#configure terminal 
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname R-08

R-08(config)#interface gigabitEthernet 0/0/0
R-08(config-if)#des
R-08(config-if)#description SW-13 Link
R-08(config-if)#ip address 172.16.5.174 255.255.255.240
R-08(config-if)#ip help
R-08(config-if)#ip helper-address 172.16.0.2
R-08(config-if)#no shutdown

R-08(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0/0, changed state to up

R-08(config-if)#exit
R-08(config)#
R-08(config)#interface gigabitEthernet 0/0/1
R-08(config-if)#description SW-14 Link
R-08(config-if)#ip address 172.16.4.254 255.255.255.192
R-08(config-if)#ip helper-address 172.16.0.2
R-08(config-if)#
R-08(config-if)#no shutdown

R-08(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0/1, changed state to up

R-08(config-if)#exit
R-08(config)#
R-08(config)#
R-08(config)#interface serial 0/1/1

R-08(config-if)#description R-01 Link
R-08(config-if)#ip address 172.16.5.202 255.255.255.252
R-08(config-if)#clock rate 64000
R-08(config-if)#no shutdown

R-08(config-if)#
%LINK-5-CHANGED: Interface Serial0/1/1, changed state to up

R-08(config-if)#exit

R-08(config)#ip route 172.16.0.0 255.255.255.0 172.16.5.201
R-08(config)#ip route 172.16.1.0 255.255.255.0 172.16.5.201
R-08(config)#ip route 172.16.2.0 255.255.255.0 172.16.5.201
R-08(config)#ip route 172.16.3.0 255.255.255.128 172.16.5.201
R-08(config)#ip route 172.16.3.128 255.255.255.128 172.16.5.201
R-08(config)#ip route 172.16.4.0 255.255.255.192 172.16.5.201
R-08(config)#ip route 172.16.4.64 255.255.255.192 172.16.5.201
R-08(config)#ip route 172.16.4.128 255.255.255.192 172.16.5.201
R-08(config)#ip route 172.16.5.0 255.255.255.192 172.16.5.201
R-08(config)#ip route 172.16.5.64 255.255.255.224 172.16.5.201
R-08(config)#ip route 172.16.5.96 255.255.255.224 172.16.5.201
R-08(config)#ip route 172.16.5.128 255.255.255.224 172.16.5.201
R-08(config)#ip route 172.16.5.176 255.255.255.252 172.16.5.201
R-08(config)#ip route 172.16.5.180 255.255.255.252 172.16.5.201
R-08(config)#ip route 172.16.5.184 255.255.255.252 172.16.5.201
R-08(config)#ip route 172.16.5.188 255.255.255.252 172.16.5.201
R-08(config)#ip route 172.16.5.192 255.255.255.252 172.16.5.201
R-08(config)#ip route 172.16.5.196 255.255.255.252 172.16.5.201
R-08(config)#
R-08(config)#exit
R-08#
%SYS-5-CONFIG_I: Configured from console by console

R-08#
R-08#copy r
R-08#copy running-config st
R-08#copy running-config startup-config 
Destination filename [startup-config]? 

R-08#copy running-config tftp: 
Address or name of remote host []? 172.16.0.2
Destination filename [R-08-confg]? R-08-confg

R-08#clock set 14:30:00 07 september 2025
R-08#
R-08#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R-08(config)#
R-08(config)#banner motd *
Enter TEXT message.  End with the character '*'.

###################################################
This is Secure area. Please Enter your Authentication.
#################################################### *

R-08(config)#
R-08(config)#enable secret DilRu@2520.lk
R-08(config)#
R-08(config)#line console 0
R-08(config-line)#
R-08(config-line)#password DIlru@2540.lk
R-08(config-line)#exec-timeout 20
R-08(config-line)#login
R-08(config-line)#exit
R-08(config)#
R-08(config)#security passwords min-length 10
R-08(config)#ip domain-name sltsc.lk
R-08(config)#crypto key generate rsa 
The name for the keys will be: R-08.sltsc.lk
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: 2048
% Generating 2048 bit RSA keys, keys will be non-exportable...[OK]

R-08(config)#username sshadmin secret Admin@$ltSc.Lk
*Sep 7 14:30:4.97: %SSH-5-ENABLED: SSH 1.99 has been enabled
R-08(config)#
R-08(config)#line vty 0
R-08(config-line)#transport input ssh
R-08(config-line)#login local 
R-08(config-line)#exec-timeout 20
R-08(config-line)#login local 
R-08(config-line)#exit
R-08(config)#
R-08(config)#login block-for 900 attempts 2 within 60